MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F064H.atdf
   <module caption="" id="02486" name="ADC" version="2">
      <register-group name="ADC">
         <register caption="ADC Control Register 1" name="AD1CON1" offset="0x0" rw="RW" size="4" initval="0x0">
            <bitfield caption="Analog-to-Digital Conversion Status bit" mask="0x00000001" name="DONE" values="AD1CON1__DONE" />
            <bitfield caption="ADC Sample Enable bit" mask="0x00000002" name="SAMP" values="AD1CON1__SAMP" />
            <bitfield caption="ADC Sample Auto-Start bit" mask="0x00000004" name="ASAM" values="AD1CON1__ASAM" />
            <bitfield caption="Stop Conversion Sequence bit (when the first ADC interrupt is generated)" mask="0x00000010" name="CLRASAM" values="AD1CON1__CLRASAM" />
            <bitfield caption="Conversion Trigger Source Select bits" mask="0x000000E0" name="SSRC" values="AD1CON1__SSRC" />
            <bitfield caption="Data Output Format bits" mask="0x00000700" name="FORM" values="AD1CON1__FORM" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="AD1CON1__SIDL" />
            <bitfield caption="ADC Operating Mode bit" mask="0x00008000" name="ON" values="AD1CON1__ON" />
         </register>
         <register caption="ADC Control Register 2" name="AD1CON2" offset="0x10" rw="RW" size="4" initval="0x0">
            <bitfield caption="Alternate Input Sample Mode Select bit" mask="0x00000001" name="ALTS" values="AD1CON2__ALTS" />
            <bitfield caption="ADC Result Buffer Mode Select bit" mask="0x00000002" name="BUFM" values="AD1CON2__BUFM" />
            <bitfield caption="Sample/Convert Sequences Per Interrupt Selection bits" mask="0x0000003C" name="SMPI" values="AD1CON2__SMPI" />
            <bitfield caption="Buffer Fill Status bit" mask="0x00000080" name="BUFS" values="AD1CON2__BUFS" />
            <bitfield caption="Input Scan Select bit" mask="0x00000400" name="CSCNA" values="AD1CON2__CSCNA" />
            <bitfield caption="Input Offset Calibration Mode Select bit" mask="0x00001000" name="OFFCAL" values="AD1CON2__OFFCAL" />
            <bitfield caption="Voltage Reference Configuration bits" mask="0x0000E000" name="VCFG" values="AD1CON2__VCFG" />
         </register>
         <register caption="ADC Control Register 3" name="AD1CON3" offset="0x20" rw="RW" size="4" initval="0x0">
            <bitfield caption="ADC Conversion Clock Select bits" mask="0x000000FF" name="ADCS" values="AD1CON3__ADCS" />
            <bitfield caption="Auto-Sample Time bits" mask="0x00001F00" name="SAMC" values="AD1CON3__SAMC" />
            <bitfield caption="ADC Conversion Clock Source bit" mask="0x00008000" name="ADRC" values="AD1CON3__ADRC" />
         </register>
         <register caption="ADC Input Select Register" name="AD1CHS" offset="0x40" rw="RW" size="4" initval="0x0">
            <bitfield caption="Positive Input Select bits for Sample A Multiplexer Setting" mask="0x003F0000" name="CH0SA" values="AD1CHS__CH0SA" />
            <bitfield caption="Negative Input Select bit for Sample A Multiplexer Setting" mask="0x00800000" name="CH0NA" values="AD1CHS__CH0NA" />
            <bitfield caption="Positive Input Select bits for Sample B" mask="0x3F000000" name="CH0SB" values="AD1CHS__CH0SB" />
            <bitfield caption="Negative Input Select bit for Sample B" mask="0x80000000" name="CH0NB" values="AD1CHS__CH0NB" />
         </register>
         <register caption="ADC Input Scan Select Register" name="AD1CSSL" offset="0x50" rw="RW" size="4" initval="0x0">
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000001" name="CSSL0" values="AD1CSSL__CSSL0" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000002" name="CSSL1" values="AD1CSSL__CSSL1" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000004" name="CSSL2" values="AD1CSSL__CSSL2" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000008" name="CSSL3" values="AD1CSSL__CSSL3" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000010" name="CSSL4" values="AD1CSSL__CSSL4" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000020" name="CSSL5" values="AD1CSSL__CSSL5" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000040" name="CSSL6" values="AD1CSSL__CSSL6" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000080" name="CSSL7" values="AD1CSSL__CSSL7" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000100" name="CSSL8" values="AD1CSSL__CSSL8" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000200" name="CSSL9" values="AD1CSSL__CSSL9" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000400" name="CSSL10" values="AD1CSSL__CSSL10" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000800" name="CSSL11" values="AD1CSSL__CSSL11" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00001000" name="CSSL12" values="AD1CSSL__CSSL12" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00002000" name="CSSL13" values="AD1CSSL__CSSL13" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00004000" name="CSSL14" values="AD1CSSL__CSSL14" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00008000" name="CSSL15" values="AD1CSSL__CSSL15" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00010000" name="CSSL16" values="AD1CSSL__CSSL16" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00020000" name="CSSL17" values="AD1CSSL__CSSL17" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00040000" name="CSSL18" values="AD1CSSL__CSSL18" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00080000" name="CSSL19" values="AD1CSSL__CSSL19" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00100000" name="CSSL20" values="AD1CSSL__CSSL20" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00200000" name="CSSL21" values="AD1CSSL__CSSL21" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00400000" name="CSSL22" values="AD1CSSL__CSSL22" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00800000" name="CSSL23" values="AD1CSSL__CSSL23" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x01000000" name="CSSL24" values="AD1CSSL__CSSL24" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x02000000" name="CSSL25" values="AD1CSSL__CSSL25" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x04000000" name="CSSL26" values="AD1CSSL__CSSL26" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x08000000" name="CSSL27" values="AD1CSSL__CSSL27" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x10000000" name="CSSL28" values="AD1CSSL__CSSL28" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x20000000" name="CSSL29" values="AD1CSSL__CSSL29" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x40000000" name="CSSL30" values="AD1CSSL__CSSL30" />
         </register>
