MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F064H.atdf
      <value-group caption="Output Compare Mode Select bits" name="OC5CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin disabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC5CON__OCTSEL">
         <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC5CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC5CON__OC32">
         <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC5CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC5CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01416" name="OSC" version="4">
      <register-group name="OSC">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4" initval="0x01200000">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="PLL Lock Status bit" mask="0x00000020" name="SLOCK" values="OSCCON__SLOCK" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Phase-Locked Loop (PLL) Multiplier bits" mask="0x00070000" name="PLLMULT" values="OSCCON__PLLMULT" />
            <bitfield caption="Peripheral Bus Clock (PBCLK) Divisor bits" mask="0x00180000" name="PBDIV" values="OSCCON__PBDIV" />
            <bitfield caption="Peripheral Bus Clock Divisor Ready bit" mask="0x00200000" name="PBDIVRDY" values="OSCCON__PBDIVRDY" />
            <bitfield caption="Secondary Oscillator (SOSC) Ready Indicator bit" mask="0x00400000" name="SOSCRDY" values="OSCCON__SOSCRDY" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
            <bitfield caption="Output Divider for PLL" mask="0x38000000" name="PLLODIV" values="OSCCON__PLLODIV" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFOCON" offset="0x20" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFOCON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFOCON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFOCON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFOCON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFOCON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFOCON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFOCON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFOCON__RODIV" />
         </register>
         <register caption="Reference Oscillator Trim Register" name="REFOTRIM" offset="0x30" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFOTRIM__ROTRIM" />
         </register>
      </register-group>
