MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F064H.atdf
         <register caption="" name="PORTF" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTF" />
            <bitfield mask="0x00000002" name="PORTF" />
            <bitfield mask="0x00000004" name="PORTF" />
            <bitfield mask="0x00000008" name="PORTF" />
            <bitfield mask="0x00000010" name="PORTF" />
            <bitfield mask="0x00000020" name="PORTF" />
            <bitfield mask="0x00000040" name="PORTF" />
            <bitfield mask="0x00000080" name="PORTF" />
            <bitfield mask="0x00000100" name="PORTF" />
            <bitfield mask="0x00000200" name="PORTF" />
            <bitfield mask="0x00000400" name="PORTF" />
            <bitfield mask="0x00000800" name="PORTF" />
            <bitfield mask="0x00001000" name="PORTF" />
            <bitfield mask="0x00002000" name="PORTF" />
            <bitfield mask="0x00004000" name="PORTF" />
            <bitfield mask="0x00008000" name="PORTF" />
         </register>
         <register caption="" name="PORTG" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTG" />
            <bitfield mask="0x00000002" name="PORTG" />
            <bitfield mask="0x00000004" name="PORTG" />
            <bitfield mask="0x00000008" name="PORTG" />
            <bitfield mask="0x00000010" name="PORTG" />
            <bitfield mask="0x00000020" name="PORTG" />
            <bitfield mask="0x00000040" name="PORTG" />
            <bitfield mask="0x00000080" name="PORTG" />
            <bitfield mask="0x00000100" name="PORTG" />
            <bitfield mask="0x00000200" name="PORTG" />
            <bitfield mask="0x00000400" name="PORTG" />
            <bitfield mask="0x00000800" name="PORTG" />
            <bitfield mask="0x00001000" name="PORTG" />
            <bitfield mask="0x00002000" name="PORTG" />
            <bitfield mask="0x00004000" name="PORTG" />
            <bitfield mask="0x00008000" name="PORTG" />
         </register>
         <register caption="" name="LATB" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB" />
            <bitfield mask="0x00000002" name="LATB" />
            <bitfield mask="0x00000004" name="LATB" />
            <bitfield mask="0x00000008" name="LATB" />
            <bitfield mask="0x00000010" name="LATB" />
            <bitfield mask="0x00000020" name="LATB" />
            <bitfield mask="0x00000040" name="LATB" />
            <bitfield mask="0x00000080" name="LATB" />
            <bitfield mask="0x00000100" name="LATB" />
            <bitfield mask="0x00000200" name="LATB" />
            <bitfield mask="0x00000400" name="LATB" />
            <bitfield mask="0x00000800" name="LATB" />
            <bitfield mask="0x00001000" name="LATB" />
            <bitfield mask="0x00002000" name="LATB" />
            <bitfield mask="0x00004000" name="LATB" />
            <bitfield mask="0x00008000" name="LATB" />
         </register>
         <register caption="" name="LATC" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATC" />
            <bitfield mask="0x00000002" name="LATC" />
            <bitfield mask="0x00000004" name="LATC" />
            <bitfield mask="0x00000008" name="LATC" />
            <bitfield mask="0x00000010" name="LATC" />
            <bitfield mask="0x00000020" name="LATC" />
            <bitfield mask="0x00000040" name="LATC" />
            <bitfield mask="0x00000080" name="LATC" />
            <bitfield mask="0x00000100" name="LATC" />
            <bitfield mask="0x00000200" name="LATC" />
            <bitfield mask="0x00000400" name="LATC" />
            <bitfield mask="0x00000800" name="LATC" />
            <bitfield mask="0x00001000" name="LATC" />
            <bitfield mask="0x00002000" name="LATC" />
            <bitfield mask="0x00004000" name="LATC" />
            <bitfield mask="0x00008000" name="LATC" />
         </register>
         <register caption="" name="LATD" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD" />
            <bitfield mask="0x00000002" name="LATD" />
            <bitfield mask="0x00000004" name="LATD" />
            <bitfield mask="0x00000008" name="LATD" />
            <bitfield mask="0x00000010" name="LATD" />
            <bitfield mask="0x00000020" name="LATD" />
            <bitfield mask="0x00000040" name="LATD" />
            <bitfield mask="0x00000080" name="LATD" />
            <bitfield mask="0x00000100" name="LATD" />
            <bitfield mask="0x00000200" name="LATD" />
            <bitfield mask="0x00000400" name="LATD" />
            <bitfield mask="0x00000800" name="LATD" />
            <bitfield mask="0x00001000" name="LATD" />
            <bitfield mask="0x00002000" name="LATD" />
            <bitfield mask="0x00004000" name="LATD" />
            <bitfield mask="0x00008000" name="LATD" />
         </register>
         <register caption="" name="LATE" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATE" />
            <bitfield mask="0x00000002" name="LATE" />
            <bitfield mask="0x00000004" name="LATE" />
            <bitfield mask="0x00000008" name="LATE" />
            <bitfield mask="0x00000010" name="LATE" />
            <bitfield mask="0x00000020" name="LATE" />
            <bitfield mask="0x00000040" name="LATE" />
            <bitfield mask="0x00000080" name="LATE" />
            <bitfield mask="0x00000100" name="LATE" />
            <bitfield mask="0x00000200" name="LATE" />
            <bitfield mask="0x00000400" name="LATE" />
            <bitfield mask="0x00000800" name="LATE" />
            <bitfield mask="0x00001000" name="LATE" />
            <bitfield mask="0x00002000" name="LATE" />
            <bitfield mask="0x00004000" name="LATE" />
            <bitfield mask="0x00008000" name="LATE" />
         </register>
         <register caption="" name="LATF" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF" />
            <bitfield mask="0x00000002" name="LATF" />
            <bitfield mask="0x00000004" name="LATF" />
            <bitfield mask="0x00000008" name="LATF" />
            <bitfield mask="0x00000010" name="LATF" />
            <bitfield mask="0x00000020" name="LATF" />
            <bitfield mask="0x00000040" name="LATF" />
            <bitfield mask="0x00000080" name="LATF" />
            <bitfield mask="0x00000100" name="LATF" />
            <bitfield mask="0x00000200" name="LATF" />
            <bitfield mask="0x00000400" name="LATF" />
            <bitfield mask="0x00000800" name="LATF" />
            <bitfield mask="0x00001000" name="LATF" />
            <bitfield mask="0x00002000" name="LATF" />
            <bitfield mask="0x00004000" name="LATF" />
            <bitfield mask="0x00008000" name="LATF" />
         </register>
