MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F064H.atdf
         <register caption="" name="CNPUB" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUB" />
            <bitfield mask="0x00000002" name="CNPUB" />
            <bitfield mask="0x00000004" name="CNPUB" />
            <bitfield mask="0x00000008" name="CNPUB" />
            <bitfield mask="0x00000010" name="CNPUB" />
            <bitfield mask="0x00000020" name="CNPUB" />
            <bitfield mask="0x00000040" name="CNPUB" />
            <bitfield mask="0x00000080" name="CNPUB" />
            <bitfield mask="0x00000100" name="CNPUB" />
            <bitfield mask="0x00000200" name="CNPUB" />
            <bitfield mask="0x00000400" name="CNPUB" />
            <bitfield mask="0x00000800" name="CNPUB" />
            <bitfield mask="0x00001000" name="CNPUB" />
            <bitfield mask="0x00002000" name="CNPUB" />
            <bitfield mask="0x00004000" name="CNPUB" />
            <bitfield mask="0x00008000" name="CNPUB" />
         </register>
         <register caption="" name="CNPUC" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUC" />
            <bitfield mask="0x00000002" name="CNPUC" />
            <bitfield mask="0x00000004" name="CNPUC" />
            <bitfield mask="0x00000008" name="CNPUC" />
            <bitfield mask="0x00000010" name="CNPUC" />
            <bitfield mask="0x00000020" name="CNPUC" />
            <bitfield mask="0x00000040" name="CNPUC" />
            <bitfield mask="0x00000080" name="CNPUC" />
            <bitfield mask="0x00000100" name="CNPUC" />
            <bitfield mask="0x00000200" name="CNPUC" />
            <bitfield mask="0x00000400" name="CNPUC" />
            <bitfield mask="0x00000800" name="CNPUC" />
            <bitfield mask="0x00001000" name="CNPUC" />
            <bitfield mask="0x00002000" name="CNPUC" />
            <bitfield mask="0x00004000" name="CNPUC" />
            <bitfield mask="0x00008000" name="CNPUC" />
         </register>
         <register caption="" name="CNPUD" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUD" />
            <bitfield mask="0x00000002" name="CNPUD" />
            <bitfield mask="0x00000004" name="CNPUD" />
            <bitfield mask="0x00000008" name="CNPUD" />
            <bitfield mask="0x00000010" name="CNPUD" />
            <bitfield mask="0x00000020" name="CNPUD" />
            <bitfield mask="0x00000040" name="CNPUD" />
            <bitfield mask="0x00000080" name="CNPUD" />
            <bitfield mask="0x00000100" name="CNPUD" />
            <bitfield mask="0x00000200" name="CNPUD" />
            <bitfield mask="0x00000400" name="CNPUD" />
            <bitfield mask="0x00000800" name="CNPUD" />
            <bitfield mask="0x00001000" name="CNPUD" />
            <bitfield mask="0x00002000" name="CNPUD" />
            <bitfield mask="0x00004000" name="CNPUD" />
            <bitfield mask="0x00008000" name="CNPUD" />
         </register>
         <register caption="" name="CNPUE" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUE" />
            <bitfield mask="0x00000002" name="CNPUE" />
            <bitfield mask="0x00000004" name="CNPUE" />
            <bitfield mask="0x00000008" name="CNPUE" />
            <bitfield mask="0x00000010" name="CNPUE" />
            <bitfield mask="0x00000020" name="CNPUE" />
            <bitfield mask="0x00000040" name="CNPUE" />
            <bitfield mask="0x00000080" name="CNPUE" />
            <bitfield mask="0x00000100" name="CNPUE" />
            <bitfield mask="0x00000200" name="CNPUE" />
            <bitfield mask="0x00000400" name="CNPUE" />
            <bitfield mask="0x00000800" name="CNPUE" />
            <bitfield mask="0x00001000" name="CNPUE" />
            <bitfield mask="0x00002000" name="CNPUE" />
            <bitfield mask="0x00004000" name="CNPUE" />
            <bitfield mask="0x00008000" name="CNPUE" />
         </register>
         <register caption="" name="CNPUF" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUF" />
            <bitfield mask="0x00000002" name="CNPUF" />
            <bitfield mask="0x00000004" name="CNPUF" />
            <bitfield mask="0x00000008" name="CNPUF" />
            <bitfield mask="0x00000010" name="CNPUF" />
            <bitfield mask="0x00000020" name="CNPUF" />
            <bitfield mask="0x00000040" name="CNPUF" />
            <bitfield mask="0x00000080" name="CNPUF" />
            <bitfield mask="0x00000100" name="CNPUF" />
            <bitfield mask="0x00000200" name="CNPUF" />
            <bitfield mask="0x00000400" name="CNPUF" />
            <bitfield mask="0x00000800" name="CNPUF" />
            <bitfield mask="0x00001000" name="CNPUF" />
            <bitfield mask="0x00002000" name="CNPUF" />
            <bitfield mask="0x00004000" name="CNPUF" />
            <bitfield mask="0x00008000" name="CNPUF" />
         </register>
         <register caption="" name="CNPUG" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUG" />
            <bitfield mask="0x00000002" name="CNPUG" />
            <bitfield mask="0x00000004" name="CNPUG" />
            <bitfield mask="0x00000008" name="CNPUG" />
            <bitfield mask="0x00000010" name="CNPUG" />
            <bitfield mask="0x00000020" name="CNPUG" />
            <bitfield mask="0x00000040" name="CNPUG" />
            <bitfield mask="0x00000080" name="CNPUG" />
            <bitfield mask="0x00000100" name="CNPUG" />
            <bitfield mask="0x00000200" name="CNPUG" />
            <bitfield mask="0x00000400" name="CNPUG" />
            <bitfield mask="0x00000800" name="CNPUG" />
            <bitfield mask="0x00001000" name="CNPUG" />
            <bitfield mask="0x00002000" name="CNPUG" />
            <bitfield mask="0x00004000" name="CNPUG" />
            <bitfield mask="0x00008000" name="CNPUG" />
         </register>
         <register caption="" name="CNPDB" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB" />
            <bitfield mask="0x00000002" name="CNPDB" />
            <bitfield mask="0x00000004" name="CNPDB" />
            <bitfield mask="0x00000008" name="CNPDB" />
            <bitfield mask="0x00000010" name="CNPDB" />
            <bitfield mask="0x00000020" name="CNPDB" />
            <bitfield mask="0x00000040" name="CNPDB" />
            <bitfield mask="0x00000080" name="CNPDB" />
            <bitfield mask="0x00000100" name="CNPDB" />
            <bitfield mask="0x00000200" name="CNPDB" />
            <bitfield mask="0x00000400" name="CNPDB" />
            <bitfield mask="0x00000800" name="CNPDB" />
            <bitfield mask="0x00001000" name="CNPDB" />
            <bitfield mask="0x00002000" name="CNPDB" />
            <bitfield mask="0x00004000" name="CNPDB" />
            <bitfield mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNPDC" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC" />
            <bitfield mask="0x00000002" name="CNPDC" />
            <bitfield mask="0x00000004" name="CNPDC" />
            <bitfield mask="0x00000008" name="CNPDC" />
            <bitfield mask="0x00000010" name="CNPDC" />
            <bitfield mask="0x00000020" name="CNPDC" />
            <bitfield mask="0x00000040" name="CNPDC" />
            <bitfield mask="0x00000080" name="CNPDC" />
            <bitfield mask="0x00000100" name="CNPDC" />
            <bitfield mask="0x00000200" name="CNPDC" />
            <bitfield mask="0x00000400" name="CNPDC" />
            <bitfield mask="0x00000800" name="CNPDC" />
            <bitfield mask="0x00001000" name="CNPDC" />
            <bitfield mask="0x00002000" name="CNPDC" />
            <bitfield mask="0x00004000" name="CNPDC" />
            <bitfield mask="0x00008000" name="CNPDC" />
         </register>
         <register caption="" name="CNPDD" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDD" />
            <bitfield mask="0x00000002" name="CNPDD" />
            <bitfield mask="0x00000004" name="CNPDD" />
            <bitfield mask="0x00000008" name="CNPDD" />
            <bitfield mask="0x00000010" name="CNPDD" />
            <bitfield mask="0x00000020" name="CNPDD" />
            <bitfield mask="0x00000040" name="CNPDD" />
            <bitfield mask="0x00000080" name="CNPDD" />
            <bitfield mask="0x00000100" name="CNPDD" />
            <bitfield mask="0x00000200" name="CNPDD" />
            <bitfield mask="0x00000400" name="CNPDD" />
            <bitfield mask="0x00000800" name="CNPDD" />
            <bitfield mask="0x00001000" name="CNPDD" />
            <bitfield mask="0x00002000" name="CNPDD" />
            <bitfield mask="0x00004000" name="CNPDD" />
            <bitfield mask="0x00008000" name="CNPDD" />
         </register>
         <register caption="" name="CNPDE" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDE" />
            <bitfield mask="0x00000002" name="CNPDE" />
            <bitfield mask="0x00000004" name="CNPDE" />
            <bitfield mask="0x00000008" name="CNPDE" />
            <bitfield mask="0x00000010" name="CNPDE" />
            <bitfield mask="0x00000020" name="CNPDE" />
            <bitfield mask="0x00000040" name="CNPDE" />
            <bitfield mask="0x00000080" name="CNPDE" />
            <bitfield mask="0x00000100" name="CNPDE" />
            <bitfield mask="0x00000200" name="CNPDE" />
            <bitfield mask="0x00000400" name="CNPDE" />
            <bitfield mask="0x00000800" name="CNPDE" />
            <bitfield mask="0x00001000" name="CNPDE" />
            <bitfield mask="0x00002000" name="CNPDE" />
            <bitfield mask="0x00004000" name="CNPDE" />
            <bitfield mask="0x00008000" name="CNPDE" />
         </register>
         <register caption="" name="CNPDF" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDF" />
            <bitfield mask="0x00000002" name="CNPDF" />
            <bitfield mask="0x00000004" name="CNPDF" />
            <bitfield mask="0x00000008" name="CNPDF" />
            <bitfield mask="0x00000010" name="CNPDF" />
            <bitfield mask="0x00000020" name="CNPDF" />
            <bitfield mask="0x00000040" name="CNPDF" />
            <bitfield mask="0x00000080" name="CNPDF" />
            <bitfield mask="0x00000100" name="CNPDF" />
            <bitfield mask="0x00000200" name="CNPDF" />
            <bitfield mask="0x00000400" name="CNPDF" />
            <bitfield mask="0x00000800" name="CNPDF" />
            <bitfield mask="0x00001000" name="CNPDF" />
            <bitfield mask="0x00002000" name="CNPDF" />
            <bitfield mask="0x00004000" name="CNPDF" />
            <bitfield mask="0x00008000" name="CNPDF" />
         </register>
         <register caption="" name="CNPDG" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDG" />
            <bitfield mask="0x00000002" name="CNPDG" />
            <bitfield mask="0x00000004" name="CNPDG" />
            <bitfield mask="0x00000008" name="CNPDG" />
            <bitfield mask="0x00000010" name="CNPDG" />
            <bitfield mask="0x00000020" name="CNPDG" />
            <bitfield mask="0x00000040" name="CNPDG" />
            <bitfield mask="0x00000080" name="CNPDG" />
            <bitfield mask="0x00000100" name="CNPDG" />
            <bitfield mask="0x00000200" name="CNPDG" />
            <bitfield mask="0x00000400" name="CNPDG" />
            <bitfield mask="0x00000800" name="CNPDG" />
            <bitfield mask="0x00001000" name="CNPDG" />
            <bitfield mask="0x00002000" name="CNPDG" />
            <bitfield mask="0x00004000" name="CNPDG" />
            <bitfield mask="0x00008000" name="CNPDG" />
         </register>
         <register caption="" name="CNCONB" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONC" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCOND" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONE" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONF" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONG" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNENB" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB" />
            <bitfield mask="0x00000002" name="CNENB" />
            <bitfield mask="0x00000004" name="CNENB" />
            <bitfield mask="0x00000008" name="CNENB" />
            <bitfield mask="0x00000010" name="CNENB" />
            <bitfield mask="0x00000020" name="CNENB" />
            <bitfield mask="0x00000040" name="CNENB" />
            <bitfield mask="0x00000080" name="CNENB" />
            <bitfield mask="0x00000100" name="CNENB" />
            <bitfield mask="0x00000200" name="CNENB" />
            <bitfield mask="0x00000400" name="CNENB" />
            <bitfield mask="0x00000800" name="CNENB" />
            <bitfield mask="0x00001000" name="CNENB" />
            <bitfield mask="0x00002000" name="CNENB" />
            <bitfield mask="0x00004000" name="CNENB" />
            <bitfield mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNENC" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC" />
            <bitfield mask="0x00000002" name="CNENC" />
            <bitfield mask="0x00000004" name="CNENC" />
            <bitfield mask="0x00000008" name="CNENC" />
            <bitfield mask="0x00000010" name="CNENC" />
            <bitfield mask="0x00000020" name="CNENC" />
            <bitfield mask="0x00000040" name="CNENC" />
            <bitfield mask="0x00000080" name="CNENC" />
            <bitfield mask="0x00000100" name="CNENC" />
            <bitfield mask="0x00000200" name="CNENC" />
            <bitfield mask="0x00000400" name="CNENC" />
            <bitfield mask="0x00000800" name="CNENC" />
            <bitfield mask="0x00001000" name="CNENC" />
            <bitfield mask="0x00002000" name="CNENC" />
            <bitfield mask="0x00004000" name="CNENC" />
            <bitfield mask="0x00008000" name="CNENC" />
         </register>
         <register caption="" name="CNEND" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEND" />
            <bitfield mask="0x00000002" name="CNEND" />
            <bitfield mask="0x00000004" name="CNEND" />
            <bitfield mask="0x00000008" name="CNEND" />
            <bitfield mask="0x00000010" name="CNEND" />
            <bitfield mask="0x00000020" name="CNEND" />
            <bitfield mask="0x00000040" name="CNEND" />
            <bitfield mask="0x00000080" name="CNEND" />
            <bitfield mask="0x00000100" name="CNEND" />
            <bitfield mask="0x00000200" name="CNEND" />
            <bitfield mask="0x00000400" name="CNEND" />
            <bitfield mask="0x00000800" name="CNEND" />
            <bitfield mask="0x00001000" name="CNEND" />
            <bitfield mask="0x00002000" name="CNEND" />
            <bitfield mask="0x00004000" name="CNEND" />
            <bitfield mask="0x00008000" name="CNEND" />
         </register>
         <register caption="" name="CNENE" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENE" />
            <bitfield mask="0x00000002" name="CNENE" />
            <bitfield mask="0x00000004" name="CNENE" />
            <bitfield mask="0x00000008" name="CNENE" />
            <bitfield mask="0x00000010" name="CNENE" />
            <bitfield mask="0x00000020" name="CNENE" />
            <bitfield mask="0x00000040" name="CNENE" />
            <bitfield mask="0x00000080" name="CNENE" />
            <bitfield mask="0x00000100" name="CNENE" />
            <bitfield mask="0x00000200" name="CNENE" />
            <bitfield mask="0x00000400" name="CNENE" />
            <bitfield mask="0x00000800" name="CNENE" />
            <bitfield mask="0x00001000" name="CNENE" />
            <bitfield mask="0x00002000" name="CNENE" />
            <bitfield mask="0x00004000" name="CNENE" />
            <bitfield mask="0x00008000" name="CNENE" />
         </register>
         <register caption="" name="CNENF" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENF" />
            <bitfield mask="0x00000002" name="CNENF" />
            <bitfield mask="0x00000004" name="CNENF" />
            <bitfield mask="0x00000008" name="CNENF" />
            <bitfield mask="0x00000010" name="CNENF" />
            <bitfield mask="0x00000020" name="CNENF" />
            <bitfield mask="0x00000040" name="CNENF" />
            <bitfield mask="0x00000080" name="CNENF" />
            <bitfield mask="0x00000100" name="CNENF" />
            <bitfield mask="0x00000200" name="CNENF" />
            <bitfield mask="0x00000400" name="CNENF" />
            <bitfield mask="0x00000800" name="CNENF" />
            <bitfield mask="0x00001000" name="CNENF" />
            <bitfield mask="0x00002000" name="CNENF" />
            <bitfield mask="0x00004000" name="CNENF" />
            <bitfield mask="0x00008000" name="CNENF" />
         </register>
         <register caption="" name="CNENG" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENG" />
            <bitfield mask="0x00000002" name="CNENG" />
            <bitfield mask="0x00000004" name="CNENG" />
            <bitfield mask="0x00000008" name="CNENG" />
            <bitfield mask="0x00000010" name="CNENG" />
            <bitfield mask="0x00000020" name="CNENG" />
            <bitfield mask="0x00000040" name="CNENG" />
            <bitfield mask="0x00000080" name="CNENG" />
            <bitfield mask="0x00000100" name="CNENG" />
            <bitfield mask="0x00000200" name="CNENG" />
            <bitfield mask="0x00000400" name="CNENG" />
            <bitfield mask="0x00000800" name="CNENG" />
            <bitfield mask="0x00001000" name="CNENG" />
            <bitfield mask="0x00002000" name="CNENG" />
            <bitfield mask="0x00004000" name="CNENG" />
            <bitfield mask="0x00008000" name="CNENG" />
         </register>
